import random

from source import *

graph = {
    '西塱站': {'坑口站': 2},
    '坑口站': {'西塱站': 2, '花地湾站': 3},
    '花地湾站': {'坑口站': 3, '芳村站': 1},
    '芳村站': {'花地湾站': 1, '黄沙站': 4},
    '黄沙站': {'芳村站': 4, '长寿路站': 5},
    '长寿路站': {'黄沙站': 5, '陈家祠站': 5},
    '陈家祠站': {'长寿路站': 5, '西门口站': 4},
    '西门口站': {'陈家祠站': 4, '公园前站': 2},
    '公园前站1': {'西门口站': 2, '农讲所站': 3, '公园前站2': 10},
    '农讲所站': {'公园前站': 3, '烈士陵园站': 3},
    '烈士陵园站': {'农讲所站': 3, '东山口站': 5},
    '东山口站': {'烈士陵园站': 5, '杨箕站': 5},
    '杨箕站': {'东山口站': 5, '体育西路站': 3},
    '体育西路站': {'杨箕站': 3, '体育中心站': 5},
    '体育中心站': {'体育西路站': 5, '广州东站': 5},
    '广州南站': {'石壁站': 4},
    '石壁站': {'广州南站': 4, '会江站': 3},
    '会江站': {'石壁站': 3, '南浦站': 5},
    '南浦站': {'会江站': 5, '洛溪站': 2},
    '洛溪站': {'南浦站': 2, '南洲站': 4},
    '南洲站': {'洛溪站': 4, '东晓南站': 3},
    '东晓南站': {'南洲站': 3, '江泰路站': 4},
    '江泰路站': {'东晓南站': 4, '昌岗站': 3},
    '昌岗站': {'江泰路站': 3, '江南西站': 3},
    '江南西站': {'昌岗站': 3, '市二宫站': 4},
    '市二宫站': {'江南西站': 4, '海珠广场站': 4},
    '海珠广场站': {'市二宫站': 4, '公园前站': 1},
    '公园前站2': {'海珠广场站': 1, '纪念堂站': 1, '公园前站1': 10},
    '纪念堂站': {'公园前站': 1, '越秀公园站': 1},
    '越秀公园站': {'纪念堂站': 1, '广州火车站': 3},
    '广州火车站': {'越秀公园站': 3, '三元里站': 3},
    '三元里站': {'广州火车站': 3, '飞翔公园站': 3},
    '飞翔公园站': {'三元里站': 3, '白云公园站': 4},
    '白云公园站': {'飞翔公园站': 4, '白云文化广场站': 3},
    '白云文化广场站': {'白云公园站': 3, '萧岗站': 3},
    '萧岗站': {'白云文化广场站': 3, '江夏站': 1},
    '江夏站': {'萧岗站': 1, '黄边站': 2},
    '黄边站': {'江夏站': 2, '嘉禾望岗站': 1},
}


# '珠江新城站', '体育西路站', '石牌桥站', '岗顶站',
# '华师站', '五山站', '天河客运站', '林和西站',
# '广州东站', '燕塘站', '梅花园站',
# '广州塔站', '客村站', '大塘站',
# '沥滘站', '梅花园站', '京溪南方医院站',
# '同和站', '永泰站', '白云大道北站',
# '嘉禾望岗站', '龙归站', '人和站',
# '高增站', '厦滘站', '大石站',
# '汉溪长隆站', '市桥站', '番禺广场站',
# '机场南站', '机场北站'
def randomint():
    return random.randint(0, 5)


print(randomint())
