l1 = ['体育西路站', '体育中心站', '广州东站', '杨箕站', '东山口站',
      '烈士陵园站', '农讲所站', '公园前站', '西门口站', '陈家祠站', '长寿路站', '黄沙站', '芳村站', '花地湾站',
      '坑口站', '西塱站']
l2 = ['广州火车站', '越秀公园站', '纪念堂站', '公园前站', '海珠广场站', '市二宫站', '江南西站', '昌岗站',
      '江泰路站', '东晓南站', '南洲站', '三元里站', '飞翔公园站', '白云公园站', '白云文化广场站', '萧岗站', '江夏站',
      '黄边站', '嘉禾望岗站', '洛溪站', '南浦站', '会江站', '石壁站', '广州南站']
l3 = ['珠江新城站', '体育西路站', '石牌桥站', '岗顶站',
      '华师站', '五山站', '天河客运站', '林和西站', '广州东站', '燕塘站', '梅花园站', '广州塔站', '客村站', '大塘站',
      '沥滘站', '梅花园站', '京溪南方医院站', '同和站', '永泰站', '白云大道北站', '嘉禾望岗站', '龙归站', '人和站',
      '高增站', '厦滘站', '大石站', '汉溪长隆站', '市桥站', '番禺广场站', '机场南站', '机场北站']
l1Tl2 = ['公园前站']
l1Tl3 = ['体育西路站', '广州东站']
l2Tl3 = ['嘉禾望岗站']
lenl1 = 16
lenl2 = 24
lenl3 = 31
lt = ['体育西路站', '体育中心站', '广州东站', '杨箕站', '东山口站', '烈士陵园站', '农讲所站', '公园前站', '西门口站',
       '陈家祠站', '长寿路站', '黄沙站', '芳村站', '花地湾站', '坑口站', '西塱站',
       '广州火车站', '越秀公园站', '纪念堂站', '公园前站', '海珠广场站', '市二宫站', '江南西站', '昌岗站', '江泰路站',
       '东晓南站', '南洲站', '三元里站', '飞翔公园站', '白云公园站', '白云文化广场站', '萧岗站', '江夏站', '黄边站',
       '嘉禾望岗站', '洛溪站', '南浦站', '会江站', '石壁站', '广州南站',
       '珠江新城站', '体育西路站', '石牌桥站', '岗顶站', '华师站', '五山站', '天河客运站', '林和西站', '广州东站',
       '燕塘站', '梅花园站', '广州塔站', '客村站', '大塘站', '沥滘站', '梅花园站', '京溪南方医院站', '同和站',
       '永泰站', '白云大道北站', '嘉禾望岗站', '龙归站', '人和站', '高增站', '厦滘站', '大石站', '汉溪长隆站',
       '市桥站', '番禺广场站', '机场南站', '机场北站']
lenlt = 71

